Microchip-MPLAB-Harmony/reference_apps/apps/pic32cm_ls00_cnano/pic32cm_ls00_map_examples/begin/tcc_synchronous_pwm_channels/firmware/tcc_timer_mode/src/packs/PIC32CM5164LS00048_DFP/component/oscctrl.h
/* -------- OSCCTRL_DFLLULPDLY : (OSCCTRL Offset: 0x20) (R/W 32) DFLLULP Delay Value -------- */
#define OSCCTRL_DFLLULPDLY_RESETVALUE         _UINT32_(0x80)                                       /*  (OSCCTRL_DFLLULPDLY) DFLLULP Delay Value  Reset Value */

#define OSCCTRL_DFLLULPDLY_DELAY_Pos          _UINT32_(0)                                          /* (OSCCTRL_DFLLULPDLY) Delay Value Position */
#define OSCCTRL_DFLLULPDLY_DELAY_Msk          (_UINT32_(0xFF) << OSCCTRL_DFLLULPDLY_DELAY_Pos)     /* (OSCCTRL_DFLLULPDLY) Delay Value Mask */
#define OSCCTRL_DFLLULPDLY_DELAY(value)       (OSCCTRL_DFLLULPDLY_DELAY_Msk & (_UINT32_(value) << OSCCTRL_DFLLULPDLY_DELAY_Pos)) /* Assigment of value for DELAY in the OSCCTRL_DFLLULPDLY register */
#define OSCCTRL_DFLLULPDLY_Msk                _UINT32_(0x000000FF)                                 /* (OSCCTRL_DFLLULPDLY) Register Mask  */


/* -------- OSCCTRL_DFLLULPRATIO : (OSCCTRL Offset: 0x24) (R/W 32) DFLLULP Target Ratio -------- */
#define OSCCTRL_DFLLULPRATIO_RESETVALUE       _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLULPRATIO) DFLLULP Target Ratio  Reset Value */

#define OSCCTRL_DFLLULPRATIO_RATIO_Pos        _UINT32_(0)                                          /* (OSCCTRL_DFLLULPRATIO) Target Tuner Ratio Position */
#define OSCCTRL_DFLLULPRATIO_RATIO_Msk        (_UINT32_(0x7FF) << OSCCTRL_DFLLULPRATIO_RATIO_Pos)  /* (OSCCTRL_DFLLULPRATIO) Target Tuner Ratio Mask */
#define OSCCTRL_DFLLULPRATIO_RATIO(value)     (OSCCTRL_DFLLULPRATIO_RATIO_Msk & (_UINT32_(value) << OSCCTRL_DFLLULPRATIO_RATIO_Pos)) /* Assigment of value for RATIO in the OSCCTRL_DFLLULPRATIO register */
#define OSCCTRL_DFLLULPRATIO_Msk              _UINT32_(0x000007FF)                                 /* (OSCCTRL_DFLLULPRATIO) Register Mask  */


/* -------- OSCCTRL_DFLLULPSYNCBUSY : (OSCCTRL Offset: 0x28) ( R/ 32) DFLLULP Synchronization Busy -------- */
#define OSCCTRL_DFLLULPSYNCBUSY_RESETVALUE    _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLULPSYNCBUSY) DFLLULP Synchronization Busy  Reset Value */

#define OSCCTRL_DFLLULPSYNCBUSY_ENABLE_Pos    _UINT32_(1)                                          /* (OSCCTRL_DFLLULPSYNCBUSY) Enable Bit Synchronization Busy Position */
#define OSCCTRL_DFLLULPSYNCBUSY_ENABLE_Msk    (_UINT32_(0x1) << OSCCTRL_DFLLULPSYNCBUSY_ENABLE_Pos) /* (OSCCTRL_DFLLULPSYNCBUSY) Enable Bit Synchronization Busy Mask */
#define OSCCTRL_DFLLULPSYNCBUSY_ENABLE(value) (OSCCTRL_DFLLULPSYNCBUSY_ENABLE_Msk & (_UINT32_(value) << OSCCTRL_DFLLULPSYNCBUSY_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_DFLLULPSYNCBUSY register */
#define OSCCTRL_DFLLULPSYNCBUSY_DELAY_Pos     _UINT32_(3)                                          /* (OSCCTRL_DFLLULPSYNCBUSY) Delay Register Synchronization Busy Position */
#define OSCCTRL_DFLLULPSYNCBUSY_DELAY_Msk     (_UINT32_(0x1) << OSCCTRL_DFLLULPSYNCBUSY_DELAY_Pos) /* (OSCCTRL_DFLLULPSYNCBUSY) Delay Register Synchronization Busy Mask */
#define OSCCTRL_DFLLULPSYNCBUSY_DELAY(value)  (OSCCTRL_DFLLULPSYNCBUSY_DELAY_Msk & (_UINT32_(value) << OSCCTRL_DFLLULPSYNCBUSY_DELAY_Pos)) /* Assigment of value for DELAY in the OSCCTRL_DFLLULPSYNCBUSY register */
#define OSCCTRL_DFLLULPSYNCBUSY_Msk           _UINT32_(0x0000000A)                                 /* (OSCCTRL_DFLLULPSYNCBUSY) Register Mask  */


/* -------- OSCCTRL_DFLLCTRL : (OSCCTRL Offset: 0x30) (R/W 16) DFLL48M Control -------- */
#define OSCCTRL_DFLLCTRL_RESETVALUE           _UINT16_(0x80)                                       /*  (OSCCTRL_DFLLCTRL) DFLL48M Control  Reset Value */

#define OSCCTRL_DFLLCTRL_ENABLE_Pos           _UINT16_(1)                                          /* (OSCCTRL_DFLLCTRL) DFLL Enable Position */
#define OSCCTRL_DFLLCTRL_ENABLE_Msk           (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_ENABLE_Pos)       /* (OSCCTRL_DFLLCTRL) DFLL Enable Mask */
#define OSCCTRL_DFLLCTRL_ENABLE(value)        (OSCCTRL_DFLLCTRL_ENABLE_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_ENABLE_Pos)) /* Assigment of value for ENABLE in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_MODE_Pos             _UINT16_(2)                                          /* (OSCCTRL_DFLLCTRL) Operating Mode Selection Position */
#define OSCCTRL_DFLLCTRL_MODE_Msk             (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_MODE_Pos)         /* (OSCCTRL_DFLLCTRL) Operating Mode Selection Mask */
#define OSCCTRL_DFLLCTRL_MODE(value)          (OSCCTRL_DFLLCTRL_MODE_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_MODE_Pos)) /* Assigment of value for MODE in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_STABLE_Pos           _UINT16_(3)                                          /* (OSCCTRL_DFLLCTRL) Stable DFLL Frequency Position */
#define OSCCTRL_DFLLCTRL_STABLE_Msk           (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_STABLE_Pos)       /* (OSCCTRL_DFLLCTRL) Stable DFLL Frequency Mask */
#define OSCCTRL_DFLLCTRL_STABLE(value)        (OSCCTRL_DFLLCTRL_STABLE_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_STABLE_Pos)) /* Assigment of value for STABLE in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_LLAW_Pos             _UINT16_(4)                                          /* (OSCCTRL_DFLLCTRL) Lose Lock After Wake Position */
#define OSCCTRL_DFLLCTRL_LLAW_Msk             (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_LLAW_Pos)         /* (OSCCTRL_DFLLCTRL) Lose Lock After Wake Mask */
#define OSCCTRL_DFLLCTRL_LLAW(value)          (OSCCTRL_DFLLCTRL_LLAW_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_LLAW_Pos)) /* Assigment of value for LLAW in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_USBCRM_Pos           _UINT16_(5)                                          /* (OSCCTRL_DFLLCTRL) USB Clock Recovery Mode Position */
#define OSCCTRL_DFLLCTRL_USBCRM_Msk           (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_USBCRM_Pos)       /* (OSCCTRL_DFLLCTRL) USB Clock Recovery Mode Mask */
#define OSCCTRL_DFLLCTRL_USBCRM(value)        (OSCCTRL_DFLLCTRL_USBCRM_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_USBCRM_Pos)) /* Assigment of value for USBCRM in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_RUNSTDBY_Pos         _UINT16_(6)                                          /* (OSCCTRL_DFLLCTRL) Run in Standby Position */
#define OSCCTRL_DFLLCTRL_RUNSTDBY_Msk         (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_RUNSTDBY_Pos)     /* (OSCCTRL_DFLLCTRL) Run in Standby Mask */
#define OSCCTRL_DFLLCTRL_RUNSTDBY(value)      (OSCCTRL_DFLLCTRL_RUNSTDBY_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_RUNSTDBY_Pos)) /* Assigment of value for RUNSTDBY in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_ONDEMAND_Pos         _UINT16_(7)                                          /* (OSCCTRL_DFLLCTRL) On Demand Control Position */
#define OSCCTRL_DFLLCTRL_ONDEMAND_Msk         (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_ONDEMAND_Pos)     /* (OSCCTRL_DFLLCTRL) On Demand Control Mask */
#define OSCCTRL_DFLLCTRL_ONDEMAND(value)      (OSCCTRL_DFLLCTRL_ONDEMAND_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_ONDEMAND_Pos)) /* Assigment of value for ONDEMAND in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_CCDIS_Pos            _UINT16_(8)                                          /* (OSCCTRL_DFLLCTRL) Chill Cycle Disable Position */
#define OSCCTRL_DFLLCTRL_CCDIS_Msk            (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_CCDIS_Pos)        /* (OSCCTRL_DFLLCTRL) Chill Cycle Disable Mask */
#define OSCCTRL_DFLLCTRL_CCDIS(value)         (OSCCTRL_DFLLCTRL_CCDIS_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_CCDIS_Pos)) /* Assigment of value for CCDIS in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_QLDIS_Pos            _UINT16_(9)                                          /* (OSCCTRL_DFLLCTRL) Quick Lock Disable Position */
#define OSCCTRL_DFLLCTRL_QLDIS_Msk            (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_QLDIS_Pos)        /* (OSCCTRL_DFLLCTRL) Quick Lock Disable Mask */
#define OSCCTRL_DFLLCTRL_QLDIS(value)         (OSCCTRL_DFLLCTRL_QLDIS_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_QLDIS_Pos)) /* Assigment of value for QLDIS in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_BPLCKC_Pos           _UINT16_(10)                                         /* (OSCCTRL_DFLLCTRL) Bypass Coarse Lock Position */
#define OSCCTRL_DFLLCTRL_BPLCKC_Msk           (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_BPLCKC_Pos)       /* (OSCCTRL_DFLLCTRL) Bypass Coarse Lock Mask */
#define OSCCTRL_DFLLCTRL_BPLCKC(value)        (OSCCTRL_DFLLCTRL_BPLCKC_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_BPLCKC_Pos)) /* Assigment of value for BPLCKC in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_WAITLOCK_Pos         _UINT16_(11)                                         /* (OSCCTRL_DFLLCTRL) Wait Lock Position */
#define OSCCTRL_DFLLCTRL_WAITLOCK_Msk         (_UINT16_(0x1) << OSCCTRL_DFLLCTRL_WAITLOCK_Pos)     /* (OSCCTRL_DFLLCTRL) Wait Lock Mask */
#define OSCCTRL_DFLLCTRL_WAITLOCK(value)      (OSCCTRL_DFLLCTRL_WAITLOCK_Msk & (_UINT16_(value) << OSCCTRL_DFLLCTRL_WAITLOCK_Pos)) /* Assigment of value for WAITLOCK in the OSCCTRL_DFLLCTRL register */
#define OSCCTRL_DFLLCTRL_Msk                  _UINT16_(0x0FFE)                                     /* (OSCCTRL_DFLLCTRL) Register Mask  */


/* -------- OSCCTRL_DFLLVAL : (OSCCTRL Offset: 0x34) (R/W 32) DFLL48M Value -------- */
#define OSCCTRL_DFLLVAL_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLVAL) DFLL48M Value  Reset Value */

#define OSCCTRL_DFLLVAL_FINE_Pos              _UINT32_(0)                                          /* (OSCCTRL_DFLLVAL) Fine Value Position */
#define OSCCTRL_DFLLVAL_FINE_Msk              (_UINT32_(0x3FF) << OSCCTRL_DFLLVAL_FINE_Pos)        /* (OSCCTRL_DFLLVAL) Fine Value Mask */
#define OSCCTRL_DFLLVAL_FINE(value)           (OSCCTRL_DFLLVAL_FINE_Msk & (_UINT32_(value) << OSCCTRL_DFLLVAL_FINE_Pos)) /* Assigment of value for FINE in the OSCCTRL_DFLLVAL register */
#define OSCCTRL_DFLLVAL_COARSE_Pos            _UINT32_(10)                                         /* (OSCCTRL_DFLLVAL) Coarse Value Position */
#define OSCCTRL_DFLLVAL_COARSE_Msk            (_UINT32_(0x3F) << OSCCTRL_DFLLVAL_COARSE_Pos)       /* (OSCCTRL_DFLLVAL) Coarse Value Mask */
#define OSCCTRL_DFLLVAL_COARSE(value)         (OSCCTRL_DFLLVAL_COARSE_Msk & (_UINT32_(value) << OSCCTRL_DFLLVAL_COARSE_Pos)) /* Assigment of value for COARSE in the OSCCTRL_DFLLVAL register */
#define OSCCTRL_DFLLVAL_DIFF_Pos              _UINT32_(16)                                         /* (OSCCTRL_DFLLVAL) Multiplication Ratio Difference Position */
#define OSCCTRL_DFLLVAL_DIFF_Msk              (_UINT32_(0xFFFF) << OSCCTRL_DFLLVAL_DIFF_Pos)       /* (OSCCTRL_DFLLVAL) Multiplication Ratio Difference Mask */
#define OSCCTRL_DFLLVAL_DIFF(value)           (OSCCTRL_DFLLVAL_DIFF_Msk & (_UINT32_(value) << OSCCTRL_DFLLVAL_DIFF_Pos)) /* Assigment of value for DIFF in the OSCCTRL_DFLLVAL register */
#define OSCCTRL_DFLLVAL_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (OSCCTRL_DFLLVAL) Register Mask  */


/* -------- OSCCTRL_DFLLMUL : (OSCCTRL Offset: 0x38) (R/W 32) DFLL48M Multiplier -------- */
#define OSCCTRL_DFLLMUL_RESETVALUE            _UINT32_(0x00)                                       /*  (OSCCTRL_DFLLMUL) DFLL48M Multiplier  Reset Value */

#define OSCCTRL_DFLLMUL_MUL_Pos               _UINT32_(0)                                          /* (OSCCTRL_DFLLMUL) DFLL Multiply Factor Position */
#define OSCCTRL_DFLLMUL_MUL_Msk               (_UINT32_(0xFFFF) << OSCCTRL_DFLLMUL_MUL_Pos)        /* (OSCCTRL_DFLLMUL) DFLL Multiply Factor Mask */
#define OSCCTRL_DFLLMUL_MUL(value)            (OSCCTRL_DFLLMUL_MUL_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_MUL_Pos)) /* Assigment of value for MUL in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_FSTEP_Pos             _UINT32_(16)                                         /* (OSCCTRL_DFLLMUL) Fine Maximum Step Position */
#define OSCCTRL_DFLLMUL_FSTEP_Msk             (_UINT32_(0x3FF) << OSCCTRL_DFLLMUL_FSTEP_Pos)       /* (OSCCTRL_DFLLMUL) Fine Maximum Step Mask */
#define OSCCTRL_DFLLMUL_FSTEP(value)          (OSCCTRL_DFLLMUL_FSTEP_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_FSTEP_Pos)) /* Assigment of value for FSTEP in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_CSTEP_Pos             _UINT32_(26)                                         /* (OSCCTRL_DFLLMUL) Coarse Maximum Step Position */
#define OSCCTRL_DFLLMUL_CSTEP_Msk             (_UINT32_(0x3F) << OSCCTRL_DFLLMUL_CSTEP_Pos)        /* (OSCCTRL_DFLLMUL) Coarse Maximum Step Mask */
#define OSCCTRL_DFLLMUL_CSTEP(value)          (OSCCTRL_DFLLMUL_CSTEP_Msk & (_UINT32_(value) << OSCCTRL_DFLLMUL_CSTEP_Pos)) /* Assigment of value for CSTEP in the OSCCTRL_DFLLMUL register */
#define OSCCTRL_DFLLMUL_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (OSCCTRL_DFLLMUL) Register Mask  */


/* -------- OSCCTRL_DFLLSYNC : (OSCCTRL Offset: 0x3C) (R/W 8) DFLL48M Synchronization -------- */
#define OSCCTRL_DFLLSYNC_RESETVALUE           _UINT8_(0x00)                                        /*  (OSCCTRL_DFLLSYNC) DFLL48M Synchronization  Reset Value */

#define OSCCTRL_DFLLSYNC_READREQ_Pos          _UINT8_(7)                                           /* (OSCCTRL_DFLLSYNC) Read Request Position */
#define OSCCTRL_DFLLSYNC_READREQ_Msk          (_UINT8_(0x1) << OSCCTRL_DFLLSYNC_READREQ_Pos)       /* (OSCCTRL_DFLLSYNC) Read Request Mask */
#define OSCCTRL_DFLLSYNC_READREQ(value)       (OSCCTRL_DFLLSYNC_READREQ_Msk & (_UINT8_(value) << OSCCTRL_DFLLSYNC_READREQ_Pos)) /* Assigment of value for READREQ in the OSCCTRL_DFLLSYNC register */
#define OSCCTRL_DFLLSYNC_Msk                  _UINT8_(0x80)                                        /* (OSCCTRL_DFLLSYNC) Register Mask  */


